app/controllers/reservations_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 3]]
---
  def new
    @reservation = Reservation.new
    @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "reservations" ("guest", "name", "date", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["guest", 4], ["name", "Simon Tang"], ["date", "2016-06-24 10:20:00.000000"], ["restaurant_id", 4], ["created_at", "2016-06-24 20:20:50.581285"], ["updated_at", "2016-06-24 20:20:50.581285"]]
---
  def create
    @reservation = Reservation.new(reservation_params)
    @restaurant = Restaurant.find(params[:restaurant_id])
    @reservation.restaurant_id = @restaurant.id
    if @reservation.save