app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pizza Pizza"], ["address", "1000 nowhere st"], ["phone_number", "647928937"], ["created_at", "2016-06-23 20:27:04.900624"], ["updated_at", "2016-06-23 20:27:04.900624"]]